In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
pragma foreign_keys = ON; -- WARNING: by default off in sqlite
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('GizmoWorks', 25.0, 'USA');
insert into company values ('Canon', 65.0, 'Japan');
insert into company values ('Hitachi', 15.0, 'Japan');
create table product(
       pname varchar primary key, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       foreign key (manufacturer) references company(cname));
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * sqlite://
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [3]:
%%sql
DROP TABLE IF EXISTS franchise;
CREATE TABLE franchise (name TEXT, db_type TEXT);
INSERT INTO franchise VALUES ('Bobs Bagels', 'NoSQL');
INSERT INTO franchise VALUES ('eBagel', 'NoSQL');
INSERT INTO franchise VALUES ('BAGEL CORP', 'MySQL');

DROP TABLE IF EXISTS store;
CREATE TABLE store (franchise TEXT, location TEXT);
INSERT INTO store VALUES ('Bobs Bagels', 'NYC');
INSERT INTO store VALUES ('eBagel', 'PA');
INSERT INTO store VALUES ('BAGEL CORP', 'Chicago');
INSERT INTO store VALUES ('BAGEL CORP', 'NYC');
INSERT INTO store VALUES ('BAGEL CORP', 'PA');

DROP TABLE IF EXISTS bagel;
CREATE TABLE bagel (name TEXT, price MONEY, made_by TEXT);
INSERT INTO bagel VALUES ('Plain with shmear', 1.99, 'Bobs Bagels');
INSERT INTO bagel VALUES ('Egg with shmear', 2.39, 'Bobs Bagels');
INSERT INTO bagel VALUES ('eBagel Drinkable Bagel', 27.99, 'eBagel');
INSERT INTO bagel VALUES ('eBagel Expansion Pack', 1.99, 'eBagel');
INSERT INTO bagel VALUES ('Plain with shmear', 0.99, 'BAGEL CORP');
INSERT INTO bagel VALUES ('Organic Flax-seed bagel chips', 0.99, 'BAGEL CORP');

DROP TABLE IF EXISTS purchase;
-- Note that date is an int here just to simplify things
CREATE TABLE purchase (bagel_name TEXT, franchise TEXT, date INT, quantity INT, purchaser_age INT);
INSERT INTO purchase VALUES ('Plain with shmear', 'Bobs Bagels', 1, 12, 28);
INSERT INTO purchase VALUES ('Egg with shmear', 'Bobs Bagels', 2, 6, 47);
INSERT INTO purchase VALUES ('Plain with shmear', 'BAGEL CORP', 2, 12, 24);
INSERT INTO purchase VALUES ('Plain with shmear', 'BAGEL CORP', 3, 1, 17);
INSERT INTO purchase VALUES ('eBagel Expansion Pack', 'eBagel', 1, 137, 5);
INSERT INTO purchase VALUES ('Plain with shmear', 'Bobs Bagels', 4, 24, NULL);

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%sql SELECT * FROM Product;

 * sqlite://
Done.

[('Gizmo', 19.99, 'Gadgets', 'GizmoWorks'),
 ('SingleTouch', 149.99, 'Photography', 'Canon'),
 ('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi')]

In [5]:
%%sql SELECT pname,price FROM Product
ORDER BY pname

 * sqlite://
Done.

[('Gizmo', 19.99),
 ('MultiTouch', 203.99),
 ('PowerGizmo', 29.99),
 ('SingleTouch', 149.99)]

In [7]:
%%sql SELECT pname FROM Product
ORDER BY Price desc#desc降序排列

 * sqlite://
Done.

[('MultiTouch',), ('SingleTouch',), ('PowerGizmo',), ('Gizmo',)]

In [8]:
# Note: in Postgresql, try the generate_series function...
%sql DROP TABLE IF EXISTS R; DROP TABLE IF EXISTS S; DROP TABLE IF EXISTS T;
%sql CREATE TABLE R (A int); CREATE TABLE S (A int); CREATE TABLE T (A int);
for i in range(1,6):
    %sql INSERT INTO R VALUES (:i)
for i in range(1,11,3):
    %sql INSERT INTO T VALUES (:i)

 * sqlite://
Done.
Done.
Done.
 * sqlite://
Done.
Done.
Done.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

In [9]:
%%sql SELECT DISTINCT R.A FROM R, S, T
WHERE R.A=S.A OR R.A=T.A

 * sqlite://
Done.

[]

In [14]:
%sql select * from S

 * sqlite://
Done.

[]

In [15]:
%%sql
SELECT R.A FROM R, S, T WHERE R.A = S.A
INTERSECT
SELECT R.A FROM R, S, T WHERE R.A = T.A

 * sqlite://
Done.

[]

In [16]:
%%sql
SELECT R.A FROM R, S, T WHERE R.A = S.A
EXCEPT
SELECT R.A FROM R, S, T WHERE R.A = T.A

 * sqlite://
Done.

[]

In [18]:
%%sql 
SELECT franchise FROM store WHERE location = 'NYC'

 * sqlite://
Done.

[('Bobs Bagels',), ('BAGEL CORP',)]

In [20]:
%%sql
SELECT f.db_type
FROM franchise f, store s 
WHERE f.name = s.franchise AND s.location = 'NYC'
INTERSECT
SELECT f.db_type
FROM franchise f, store s 
WHERE f.name = s.franchise AND s.location = 'PA'

 * sqlite://
Done.

[('NoSQL',), ('MySQL',)]

In [21]:

%%sql 
SELECT f.name, s.location, f.db_type
FROM franchise f, store s 
WHERE f.name = s.franchise;

 * sqlite://
Done.

[('Bobs Bagels', 'NYC', 'NoSQL'),
 ('eBagel', 'PA', 'NoSQL'),
 ('BAGEL CORP', 'Chicago', 'MySQL'),
 ('BAGEL CORP', 'NYC', 'MySQL'),
 ('BAGEL CORP', 'PA', 'MySQL')]

In [22]:
%%sql SELECT f.db_type
FROM franchise f, store s
WHERE f.name = s.franchise AND s.location = 'PA'

 * sqlite://
Done.

[('NoSQL',), ('MySQL',)]

In [23]:

%%sql
SELECT f.db_type
FROM franchise f
WHERE f.name IN (
    SELECT b.made_by
    FROM bagel b, purchase p
    WHERE b.name = p.bagel_name 
      AND p.purchaser_age >= 20 AND p.purchaser_age < 30);

 * sqlite://
Done.

[('NoSQL',), ('MySQL',)]

In [25]:

%%sql
SELECT b.name, b.price
FROM bagel b
WHERE b.made_by = 'eBagel'
  AND EXISTS (SELECT name FROM bagel WHERE made_by != 'eBagel' AND price > b.price);

 * sqlite://
Done.

[('eBagel Expansion Pack', 1.99)]

In [26]:
%sql SELECT AVG(price) FROM bagel WHERE made_by = 'eBagel'

 * sqlite://
Done.

[(14.989999999999998,)]

In [27]:
%sql SELECT COUNT(*) AS "Number of Stores in PA" FROM store WHERE location = 'PA';

 * sqlite://
(sqlite3.OperationalError) near "of": syntax error
[SQL: SELECT COUNT(*) AS Number of Stores in PA FROM store WHERE location = 'PA';]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [28]:

%sql SELECT COUNT(location) FROM store;

 * sqlite://
Done.

[(5,)]

In [29]:
%%sql
SELECT 
    b.name,
    GROUP_CONCAT(b.price, ',') AS prices,
    GROUP_CONCAT(b.made_by, ',') AS made_bys,
    bagel_name, 
    GROUP_CONCAT(p.franchise, ',') AS franchises,
    GROUP_CONCAT(p.date, ',') AS dates,
    GROUP_CONCAT(p.quantity, ',') AS quantities,
    GROUP_CONCAT(p.purchaser_age, ',') AS purchaser_ages
FROM bagel b, purchase p
WHERE b.name = p.bagel_name AND b.made_by = p.franchise
GROUP BY b.name;

 * sqlite://
Done.

[('Egg with shmear', '2.39', 'Bobs Bagels', 'Egg with shmear', 'Bobs Bagels', '2', '6', '47'),
 ('Plain with shmear', '1.99,1.99,0.99,0.99', 'Bobs Bagels,Bobs Bagels,BAGEL CORP,BAGEL CORP', 'Plain with shmear', 'Bobs Bagels,Bobs Bagels,BAGEL CORP,BAGEL CORP', '1,4,2,3', '12,24,12,1', '28,24,17'),
 ('eBagel Expansion Pack', '1.99', 'eBagel', 'eBagel Expansion Pack', 'eBagel', '1', '137', '5')]

In [44]:
a = [1,233,4,5]

b = a[::-1]
type(b)

list

[1, 100, 7, 11, 13, 15, 17, 19, 20, 22]